In [188]:
import pandas as pd

In [189]:
df = pd.read_csv('Disney.csv')
df.sample(3)

,Unnamed: 0,title,Production company,Release date,Running time,Country,Language,Running time (int),Budget (float),Box office (float),...,Box office,Story by,Narrated by,Cinematography,Edited by,Screenplay by,Production companies,Adaptation by,Traditional,Simplified
228,228,A Bug's Life,"['Walt Disney Pictures', 'Pixar Animation Stud...","['November 20, 1998']",95 minutes,United States,English,95.0,120000000.0,363300000.0,...,$363.3 million,"['John Lasseter', 'Andrew Stanton', 'Joe Ranft']",NaN,Sharon Calahan,Lee Unkrich,"['Andrew Stanton', 'Donald McEnery', 'Bob Shaw']",NaN,NaN,NaN,NaN
35,35,Perri,Walt Disney Productions,"August 28, 1957",75 minutes,United States,English,75.0,NaN,1750000.0,...,$1.75 million (US rentals),NaN,Winston Hibler,NaN,Jack Atwood,NaN,NaN,NaN,NaN,NaN
145,145,Herbie Goes Bananas,Walt Disney Productions,"['June 27, 1980']",98 minutes,United States,English,98.0,NaN,18000000.0,...,$18 million,NaN,NaN,Frank V. Phillips,Gordon D. Brenner,NaN,NaN,NaN,NaN,NaN

In [190]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

In [191]:
x_features = ["metascore"]
# , "metascore"
# .split("\t")
y_feature = 'imdbyy'

     imdb  metascore
1     7.6       95.0
2     7.4       99.0
3     7.8       96.0
5     7.2       96.0
6     7.3       91.0
..    ...        ...
421   8.7       90.0
422   5.4       84.0
424   6.7       58.0
425   7.6       71.0
427   7.0       53.0

[283 rows x 2 columns]

In [192]:
df = df.drop(columns=["Unnamed: 0",	"title", "Production company", "Release date", "Running time", "Country",	"Language",	"Running time",	"Budget", "Box office", "Story by", "Narrated by", "Cinematography", "Edited by", "Screenplay by", "Production companies", "Adaptation by", "Traditional", "Simplified", "rotten_tomatoes", "Release date (datetime)", "Directed by", "Produced by", "Written by", "Based on","Starring", "Music by", "Distributed by", "Running time (int)", "Budget (float)", "Box office (float)"])
df = df.dropna()
df

In [193]:
X_train, X_test, y_train, y_test = train_test_split(df[x_features]to_numpy(), df.[y_feature]to_numpy(), train_size = 0.77

In [194]:
reg = LinearRegression().fit(X_train, y_train)
reg.score(X_train, y_train) # коэффициент детерминации
#Для линейной зависимости коэффициент детерминации равен квадрату коэффициента 
#корреляции rxy: R2 = rxy2 . Например, значение R2 = 0.28, означает, что в 28% 
#случаев изменения х приводят к изменению y . Другими словами, точность подбора уравнения регрессии - ниже средней.

0.5256885008895644

In [185]:
reg.score(X_test, reg.predict(X_test))

1.0

In [186]:
mean_squared_error(y_test, reg.predict(X_test), squared=False) # MSE

0.8204144379772021

In [187]:
pd.DataFrame.from_records(data=[list(y_test), list(reg.predict(X_test))])

,0,1,2,3,4,5,6,7,8,9,...,75,76,77,78,79,80,81,82,83,84
0,7.20000,8.300000,6.400000,6.800000,8.000000,6.300000,6.900000,7.300000,7.000000,5.100000,...,7.600000,6.600000,7.50000,7.20000,5.300000,5.900000,7.800000,7.000000,7.800000,5.900000
1,6.40078,8.012748,7.690354,6.446836,8.150917,6.216555,7.874579,6.538949,6.538949,5.663881,...,7.828523,6.815286,6.76923,7.13768,5.479656,6.953455,7.229792,6.216555,7.367961,5.848105